Catalogs/Модели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>Модели</Name>
			<Comment>Модели автомобили и прочих транспортных средств</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>Код модели</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование модели автомобиля</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Comment>Производитель модели</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Производители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаскаVIN</Name>
					<Comment>Маска VIN</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>34</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автоработы</Name>
					<Comment>Группа авторабот для данной модели по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автоработы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Comment>Используется для ведения дополнительного учета валютной себестомости и цен</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Покупатель/комитент, которому производится отгрузка товаров</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорВзаиморасчетов</Name>
					<Comment>Договор по которому ведутся взаиморасчеты с контрагентом</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйИнтервалТО</Name>
					<Comment>Межсервисный интервал для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйПробегТО</Name>
					<Comment>Межсервисный пробег для тех. обслуживания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГарантии</Name>
					<Comment>Срок гарантии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТС</Name>
					<Comment>Категория транспортного средства</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КатегорияТСКОДД</Name>
					<Comment>Категория транспортного средства согласно "Конвенции о дорожном движении"</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.КатегорииТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодМодели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Марка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Марка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейОтсрочки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельИзКлассификатора</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГарантияКМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеWA</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеМодели_Аш_Промис</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДвигателя</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДвигателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспортногоСредства</Name>
					<Comment>Тип транспортного средства (по ПТС)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпециальнаяЦена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПриПокупкеВКредит</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаПриСтраховании</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкикдаПриПокупкеВТрейдИн</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаМаксимальная</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвтоРу</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели_АвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстКлассифайда</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКузова</Name>
					<Comment>Тип кузова автомобиля</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыКузовов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГенерацияАвито</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Генерации_Авито</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельАвтоРуКоммерция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Модели_АвтоРу</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельДром</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ДромМодели</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПризнакПредметаРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПризнакиПредметаРасчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйИнтервалТОноль</Name>
					<Comment>Межсервисный интервал ТО-0</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МежсервисныйПробегТОноль</Name>
					<Comment>Межсервисный пробег ТО-0</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСкидкиОтРРЦдляИнвойса</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодкатегорияКоммерческогоТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодкатегорииКоммерческогоТранспорта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Опции</Name>
					<Comment>Доступные опции для модели</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Comment>Опция модели</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Опции</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>Цена опции</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОпцииКоммерцияАвтоРу</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Опция</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОпцииКоммерцияАвтоРу</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/ВидыДоговоров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыДоговоров</Name>
			<Comment>Виды договоров</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Покупка</Name>
					<Comment>Договоры с поставщиками</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
					<Comment>Договоры с покупателями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>Договор комиссии</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>Договор с комитентом</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>Общий договор</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Кредит</Name>
					<Comment>Договор кредита</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подотчет</Name>
					<Comment>По умолчанию для контрагентов такого вида выбирается именно такой тип договора</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарплата</Name>
					<Comment>Зарплата</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатОтветственности</Name>
					<Comment>О материальной ответственности</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Модели/Ext/ObjectModule.bsl
// Модуль справочника Модели

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ ОБЪЕКТА

Перем Права Экспорт;	// Переменная объекта - ссылка на коллекцию прав, настроек и переменных окружения
Перем ИмяРеквизитаКода Экспорт;     // Кэш права "РежимВыводаКодаВДокументах". Служит для настройки вывода кода/артикула в ТЧ

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ДОПОЛНИТЕЛЬНЫХ МЕТОДОВ ОБЪЕКТА

// Возвращает структуру обязательных / уникальных реквизитов элемента
// Если ДляЭлемента = Истина, возвращаемая структура содержит реквизиты для проверки элемента
// Если ДляГруппы = Истина, аналогично для группы
// Возвращаемая структура содержит строковые идентификаторы реквизитов или вложенные структуры для табличных частей
// Для реквизита значение структуры содержит число 1-Обязательный, 3-Уникальный
Функция ПолучитьОбязательныеРеквизиты(ДляЭлемента=Истина, ДляГруппы=Ложь) Экспорт
	ОбязательныеРеквизиты=Новый Структура();
	ОбязательныеРеквизиты.Вставить("Код",1);
	ОбязательныеРеквизиты.Вставить("Наименование",1);
	Если ДляЭлемента Тогда
		ОбязательныеРеквизиты.Вставить("НаименованиеПолное",1);
		ОбязательныеРеквизиты.Вставить("ВалютаУчета",1);
		
		//Бондаренко++ 20201002
		ОбязательныеРеквизиты.Вставить("КатегорияТС",1);   
		ОбязательныеРеквизиты.Вставить("Марка",1);
		Если НЕ РольДоступна("ПолныеПрава") Тогда
 			ОбязательныеРеквизиты.Вставить("МодельАвтоРу",1); 
 			ОбязательныеРеквизиты.Вставить("МодельАвито",1);  
			ОбязательныеРеквизиты.Вставить("ГенерацияАвито",1); 
			ОбязательныеРеквизиты.Вставить("МодельДром",1); 			
		КонецЕсли;
		//Бондаренко-- 20201002
		
		ОбязательныеОпции=Новый Структура();
		ОбязательныеОпции.Вставить("Опция",3);
		ОбязательныеРеквизиты.Вставить("Опции",ОбязательныеОпции);
		////Гэндальф+++
		//ОбязательныеРеквизиты.Вставить("МежсервисныйПробегТО",1);
		//ОбязательныеРеквизиты.Вставить("МежсервисныйИнтервалТО",1);
		//Попытка
		//Если Ссылка.ПринадлежитЭлементу(Справочники.Модели.НайтиПоКоду("ЦБ00003644")) Тогда
		//	ОбязательныеРеквизиты.Вставить("ТипДвигателя",1);
		//КонецЕсли; 
		//Исключение
		//КонецПопытки;
 		////Гэндальф---
	КонецЕсли;
	Возврат ОбязательныеРеквизиты;
КонецФункции

// Проверяет корректность заполнения объекта.
// Возвращает Истина если все заполнено корректно и Ложь иначе.
// В случае некорректного заполнения формирует строку описанием возникших ошибок "Ошибки"
// На вход может быть передана структура ДопРеквизиты с дополнительными реквизитами для проверки
// может управляться булевыми флагами выполняемых проверок Заполнение, Уникальность
// (могут быть и другие необязательные)
// Обычно выполняется универсальным обработчиком, но могут быть добавлены доп. проверки
Функция ПроверитьКорректность(Ошибки="", ДопРеквизиты=Неопределено, Заполнение=Истина, Уникальность=Истина) Экспорт
	
	Рез = спПроверитьКорректность(ЭтотОбъект, Ошибки, ДопРеквизиты, Заполнение, Уникальность);
	
	Если НЕ обЗначениеНеЗаполнено(Артикул) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Модели.Ссылка
		|ИЗ
		|	Справочник.Модели КАК Модели
		|ГДЕ
		|	Модели.Артикул = &Артикул
		|	И Модели.Ссылка <> &ЭтаСсылка";
		Запрос.УстановитьПараметр("Артикул", Артикул);
		Запрос.УстановитьПараметр("ЭтаСсылка", Ссылка);
		Результат = Запрос.Выполнить().Пустой();
		дкДобавитьОшибку(Ошибки,"Артикул " +Артикул+ " не уникален");
		Рез = Рез И Результат;
	КонецЕсли;
	
	Возврат Рез;
КонецФункции
 
// Функция проверяет, допустимо ли изменение объекта
// Возвращает Истина, если изменения возможны, ложь иначе
// Если изменения доступны частично, возвращает ложь и структуру блокируемых на изменение реквизитов,
Функция ДоступностьИзменения(БлокироватьРеквизиты=Неопределено) Экспорт
	Возврат Истина;
КонецФункции

// Сформировать полное наименование
Процедура СформироватьПолноеНаименование() Экспорт
	НовоеНаименованиеПолное=Наименование;
	Если НаименованиеПолное<>НовоеНаименованиеПолное Тогда
		НаименованиеПолное=НовоеНаименованиеПолное;
	КонецЕсли; 
КонецПроцедуры

// Обработка изменения реквизитов справочников
// Параметры
//  Имя			- Строка			- Имя реквизита справочника с полным путем.
//  ЭтаФорма	- Форма				- Ссылка на форму справочника. Если значение неопределено,
//									  производится программная обработка реквизитов.
//  ТекСтрока	- СтрокаТабличнойЧасти - Ссылка на строку табличной части справочника, реквизит которой обрабатывается.
//										 Имеет смысл только для табличных частей справочников.
//  ДопПараметры- Структура			- Структура, содержащая дополнительные параметры обработки реквизита.
// Возвращаемое значение:
//   Булево   - Результат выполнения обработки.
Функция ОбработкаРеквизита(Имя,ТекСтрока=Неопределено,ЭтаФорма=Неопределено,ДопПараметры=Неопределено) Экспорт
	// ОБРАБОТКА РЕКВИЗИТОВ СПРАВОЧНИКОВ
	Если Имя="Контрагент" Тогда
		Рез=Истина;
		НовыйДоговорВзаиморасчетов=Неопределено;
		Если обЗначениеНеЗаполнено(Контрагент) Тогда
			Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
				НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			КонецЕсли; 
		Иначе
			Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
				Если ДоговорВзаиморасчетов.Владелец<>Контрагент Тогда
					НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		Если НовыйДоговорВзаиморасчетов<>Неопределено И НовыйДоговорВзаиморасчетов<>ДоговорВзаиморасчетов Тогда
			ДоговорВзаиморасчетов=НовыйДоговорВзаиморасчетов;
			Рез=ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли; 
		Возврат Рез;
		
	ИначеЕсли Имя="ДоговорВзаиморасчетов" Тогда
		Рез=Истина;
		НовыйДоговорВзаиморасчетов=Неопределено;
		Если НЕ обЗначениеНеЗаполнено(ДоговорВзаиморасчетов) Тогда
			Если ДоговорВзаиморасчетов.Владелец<>Контрагент Тогда
				НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			ИначеЕсли ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Покупка И
				ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.СКомитентом И
				ДоговорВзаиморасчетов.ВидДоговора<>Перечисления.ВидыДоговоров.Прочее Тогда
				НовыйДоговорВзаиморасчетов=Справочники.ДоговорыВзаиморасчетов.ПустаяСсылка();
			КонецЕсли;
		КонецЕсли;
		Если НовыйДоговорВзаиморасчетов<>Неопределено И НовыйДоговорВзаиморасчетов<>ДоговорВзаиморасчетов Тогда
			ДоговорВзаиморасчетов=НовыйДоговорВзаиморасчетов;
			Рез=ОбработкаРеквизита("ДоговорВзаиморасчетов",ТекСтрока,ЭтаФорма,ДопПараметры);
		КонецЕсли; 
		Возврат Рез;
		
	Иначе
		Возврат спОбработкаРеквизита(ЭтотОбъект,Имя,ТекСтрока,ЭтаФорма,ДопПараметры);
	КонецЕсли;
КонецФункции // ОбработкаРеквизита()

Функция ПолучитьНаборПараметровТестДрайва(Дата=Неопределено) Экспорт
	Возврат Справочники.Модели.ПолучитьНаборПараметровТестДрайва(Ссылка, Дата);
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СТАНДАРТНЫХ СОБЫТИЙ ОБЪЕКТА

// Стандартный обработчик заполнения при вводе нового на основании
Процедура ОбработкаЗаполнения(Основание) Экспорт
	Если НЕ спОбработкаЗаполнения(ЭтотОбъект, Основание) Тогда Возврат; КонецЕсли;
	Если ЭтоНовый() Тогда
		Если Родитель<>Неопределено Тогда
			Автоработы=Родитель.Автоработы;
		КонецЕсли; 
		Если НЕ ЭтоГруппа И обЗначениеНеЗаполнено(ВалютаУчета) Тогда
			ВалютаУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КонецЕсли; 
	КонецЕсли; 
	Модифицированность=Ложь;
КонецПроцедуры

// Стандартный обработчик копирования объекта
Процедура ПриКопировании(ОбъектКопирования)
	Если НЕ спПриКопировании(ЭтотОбъект, ОбъектКопирования) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередЗаписью элемента справочника
Процедура ПередЗаписью(Отказ)
	//Бондаренко++ 20171115
	Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.НаименованиеМодели_Аш_Промис) Тогда
		ЭтотОбъект.НаименованиеМодели_Аш_Промис = СокрЛП(ЭтотОбъект.НаименованиеМодели_Аш_Промис);
	КонецЕсли; 
	//Бондаренко-- 20171115
	//Бондаренко++ 20210320
	Если НЕ обЗначениеНеЗаполнено(Марка) Тогда
		МаркаСтрокой = СокрЛП(СтрЗаменить(Марка.Наименование,"(ВАЗ)",""));
		Если Найти(Врег(Наименование),МаркаСтрокой)=0 Тогда
			Наименование = СокрЛП(МаркаСтрокой)+" "+СокрЛП(Наименование);
		КонецЕсли; 
		Если Найти(Врег(НаименованиеПолное),МаркаСтрокой)=0 Тогда
			НаименованиеПолное = СокрЛП(МаркаСтрокой)+" "+СокрЛП(НаименованиеПолное);
		КонецЕсли; 
 	КонецЕсли; 	
 	//Бондаренко-- 20210320
	//Бондаренко++ 20210929
	Если ЭтотОбъект.Ссылка = Справочники.Модели.АвтоСПробегом Тогда
		Если ЭтотОбъект.Родитель <> Справочники.Модели.АВТОМОБИЛИ_В_ПРОДАЖЕ Тогда
			ЭтотОбъект.Родитель = Справочники.Модели.АВТОМОБИЛИ_В_ПРОДАЖЕ;			
		КонецЕсли;
	ИначеЕсли  ЭтотОбъект.Ссылка = Справочники.Модели.НЕОПРЕДЕЛЕНО Тогда
		Если НЕ обЗначениеНеЗаполнено(ЭтотОбъект.Родитель) Тогда
			ЭтотОбъект.Родитель = Справочники.Модели.ПустаяСсылка();			
		КонецЕсли	
	ИначеЕсли ЭтотОбъект.Родитель = Справочники.Модели.ПустаяСсылка() ИЛИ ЭтотОбъект.Родитель = Справочники.Модели.АВТОМОБИЛИ_В_ПРОДАЖЕ ИЛИ ЭтотОбъект.Родитель = Справочники.Модели.СТОРОННИЕ_БРЕНДЫ Тогда
		Если НЕ ЭтотОбъект.ЭтоГруппа Тогда
			#Если НаКлиенте Тогда
				Сообщить("Необходимо выбрать группу моделей второго уровня",СтатусСообщения.ОченьВажное);		 
			#КонецЕсли
			Если НЕ РольДоступна("ПолныеПрава") Тогда
				Отказ = Истина;		 	
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//Бондаренко++ 20210929 
	//Бондаренко++ 20251113
	ЭтоНовыйОбъект = Ложь;
	Попытка
	    ЭтоНовыйОбъект = ЭтотОбъект.ЭтоНовый();
 	Исключение
 	КонецПопытки; 
	Если ЭтоНовыйОбъект Тогда
		Попытка
 			ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;
 		Исключение
		КонецПопытки;
		Попытка
 			ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();
 		Исключение
 		КонецПопытки;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_Создатель) Тогда
		Попытка
 			ЭтотОбъект.СМ_Создатель = ПараметрыСеанса.Пользователь;
 		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Если обЗначениеНеЗаполнено(ЭтотОбъект.СМ_ДатаСоздания) Тогда
		Попытка
 			ЭтотОбъект.СМ_ДатаСоздания = ТекущаяДата();
 		Исключение
		КонецПопытки;
	КонецЕсли;
	//Бондаренко-- 20251113
	Если НЕ спПередЗаписью(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриЗаписи элемента справочника
Процедура ПриЗаписи(Отказ)
	Если НЕ спПриЗаписи(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПередУдалением элемента
Процедура ПередУдалением(Отказ)
	Если НЕ спПередУдалением(ЭтотОбъект, Отказ) Тогда Возврат; КонецЕсли;
КонецПроцедуры

// Стандартный обработчик ПриУстановкеНовогоКода элемента
Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс)
	Если НЕ спПриУстановкеНовогоКода(ЭтотОбъект, СтандартнаяОбработка, Префикс) Тогда Возврат; КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

// сохранение ссылки на коллекцию прав, настроек и окружения
Права = Неопределено;
#Если Клиент Тогда
Права = глПрава;
#КонецЕсли
